# OriginatingElementDescription Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
EnergyAnalysisOpening..::..OriginatingElementDescription Property
EnergyAnalysisOpening Class See Also
---
The description for the originating Revit element.
**Namespace:** Autodesk.Revit.DB.Analysis**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2012
# Syntax
C#
---
```text
public string OriginatingElementDescription { get; }
```

Visual Basic
---
```text
Public ReadOnly Property OriginatingElementDescription As String
	Get
```

Visual C++
---
```text
public:
property String^ OriginatingElementDescription {
	String^ get ();
}
```

# Remarks
Surface and Opening elements get an CADObjectId element assigned according to the below described schema, based on associative room bounding element:
(Family Name): (Family Type)[Element Id]
Sample: System Panel: System Panel [50566]
# See Also
EnergyAnalysisOpening Class
Autodesk.Revit.DB.Analysis Namespace